{
  "id": "miccai-2709",
  "title": "Small Lesions-aware Bidirectional Multimodal Multiscale Fusion Network for Lung Disease Classification",
  "abstract": "The diagnosis of medical diseases faces challenges such as the misdiagnosis of small lesions. Deep learning, particularly multimodal approaches, has shown great potential in the field of medical disease diagnosis. However, the differences in dimensionality between medical imaging and electronic health record data present challenges for effective alignment and fusion. To address these issues, we propose the Multimodal Multiscale Cross-Attention Fusion Network (MMCAF-Net). This model employs a feature pyramid structure combined with an efficient 3D multi-scale convolutional attention module to extract lesion-specific features from 3D medical images. To further enhance multimodal data integration, MMCAF-Net incorporates a multi-scale cross-attention module, which resolves dimensional inconsistencies, enabling more effective feature fusion. We evaluated MMCAF-Net on the Lung-PET-CT-Dx dataset, and the results showed a significant improvement in diagnostic accuracy, surpassing current state-of-the-art methods.",
  "authors": [
    {
      "name": "Yu, Jianxun",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Ge, Ruiquan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wang, Zhipeng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yang, Cheng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lin, Chenyu",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Fu, Xianjun",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liu, Jikui",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Elazab, Ahmed",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wang, Changmiao",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Lung",
    "Modalities -> CT / X-Ray",
    "Applications -> Computer Aided Diagnosis",
    "Machine Learning -> Deep Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2709_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}