{
  "id": "miccai-3175",
  "title": "Unpaired Multi-Site Brain MRI Harmonization with Image Style-Guided Latent Diffusion",
  "abstract": "Multi-site brain MRI heterogeneity caused by differences in scanner field strengths, acquisition protocols, and software versions poses a significant challenge for consistent analysis. Image-level harmonization, leveraging advanced learning methods, has attracted increasing attention. However, existing methods often rely on paired data (e.g., human traveling phantoms) for training, which are not always available. Some methods perform MRI harmonization by transferring target-style features to source images but require explicitly learning disentangled image styles (e.g., contrast) via encoder-decoder networks, which increases computational complexity. This paper presents an unpaired MRI harmonization (UMH) framework based on a new image style-guided diffusion model. UMH operates in two stages: (1) a coarse harmonizer that aligns multi-site MRIs to a unified domain via a conditional latent diffusion model while preserving anatomical content; and (2) a fine harmonizer that adapts coarsely harmonized images to a specific target using style embeddings derived from a pre-trained Contrastive Language-Image Pre-training (CLIP) encoder, which captures semantic style differences between the original MRIs and their coarsely-aligned counterparts, eliminating the need for paired data. By leveraging rich semantic style representations of CLIP, UMH avoids learning image styles explicitly, thereby reducing computation costs. We evaluate UMH on 4,123 MRIs from three distinct multi-site datasets, with results suggesting its superiority over several state-of-the-art (SOTA) methods across image-level comparison, downstream classification, and brain tissue segmentation tasks.",
  "authors": [
    {
      "name": "Wu, Mengqi",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yu, Minhui",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lin, Weili",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yap, Pew-Thian",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liu, Mingxia",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Brain",
    "Modalities -> MRI",
    "Applications -> Image Synthesis / Augmentation / Super-Resolution",
    "Machine Learning -> Domain Adaptation / Harmonization"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/3175_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}