{
  "id": "miccai-2260",
  "title": "BrainPrompt: Multi-Level Brain Prompt Enhancement for Neurological Condition Identification",
  "abstract": "Neurological conditions, such as Alzheimer’s Disease, are challenging to diagnose, particularly in the early stages where symptoms closely resemble healthy controls. Existing brain network analysis methods primarily focus on graph-based models that rely solely on imaging data, which may overlook important non-imaging factors and limit the model’s predictive power and interpretability. In this paper, we present BrainPrompt, an innovative framework that enhances Graph Neural Networks (GNNs) by integrating Large Language Models (LLMs) with knowledge-driven prompts, enabling more effective capture of complex, non-imaging information and external knowledge for neurological disease identification. BrainPrompt integrates three types of knowledge-driven prompts: (1) ROI-level prompts to encode the identity and function of each brain region, (2) subject-level prompts that incorporate demographic information, and (3) disease-level prompts to capture the temporal progression of disease. By leveraging these multi-level prompts, BrainPrompt effectively harnesses knowledge-enhanced multi-modal information from LLMs, enhancing the model’s capability to predict neurological disease stages and meanwhile offers more interpretable results. We evaluate BrainPrompt on two resting-state functional Magnetic Resonance Imaging (fMRI) datasets from neurological disorders, showing its superiority over state-of-the-art methods. Additionally, a biomarker study demonstrates the framework’s ability to extract valuable and interpretable information aligned with domain knowledge in neuroscience. The code is available at https://anonymous.4open.science/r/BrainPrompt.",
  "authors": [
    {
      "name": "Xu, Jiaxing",
      "affiliation": null,
      "email": null
    },
    {
      "name": "He, Kai",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Tang, Yue",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Wei",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lan, Mengcheng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Dong, Xia",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Ke, Yiping",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Feng, Mengling",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Brain",
    "Modalities -> MRI - Functional MRI",
    "Applications -> Brain Network Analysis",
    "Machine Learning -> Deep Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2260_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}