{
  "id": "miccai-1687",
  "title": "CAT-SG: A Large Dynamic Scene Graph Dataset for Fine-Grained Understanding of Cataract Surgery",
  "abstract": "Understanding the intricate workflows of cataract surgery requires modeling complex interactions between surgical tools, anatomical structures, and procedural techniques. Existing datasets primarily address isolated aspects of surgical analysis, such as tool detection or phase segmentation, but lack comprehensive representations that capture the semantic relationships between entities over time. This paper introduces the Cataract Surgery Scene Graph (CAT-SG) dataset, the first to provide structured annotations of tool-tissue interactions, procedural variations, and temporal dependencies. By incorporating detailed semantic relations, CAT-SG offers a holistic view of surgical workflows, enabling more accurate recognition of surgical phases and techniques. Additionally, we present a novel scene graph generation model, CatSGG, which outperforms current methods in generating structured surgical representations. The CAT-SG dataset is designed to enhance AI-driven surgical training, real-time decision support, and workflow analysis, paving the way for more intelligent, context-aware systems in clinical practice. The dataset is available at github.com/felixholm/CAT-SG",
  "authors": [
    {
      "name": "Holm, Felix",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Ünver, Gözde",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Ghazaei, Ghazal",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Navab, Nassir",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Eye",
    "Modalities -> Microscopy",
    "Modalities -> Photograph / Video",
    "Applications -> Other",
    "Machine Learning -> Semi- / Weakly- / Self-supervised Learning",
    "Surgery -> Data Science",
    "Surgery -> Scene Understanding",
    "Surgery -> Skill and Work Flow Analysis"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/1687_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}