{
  "id": "miccai-3436",
  "title": "Deep Knowledge-Infused Transformer for NSCLC Lymph Node Station Metastasis Prediction: Development of an AI-Powered Intraoperative Decision System",
  "abstract": "Non-small cell lung cancer (NSCLC) is one of the leading causes of cancer-related mortality, with lymph node metastasis serving as a critical factor in both prognosis and treatment decisions. Lymph node station (LNS) dissection is an essential procedure in the management of NSCLC patients; however, over-dissection may expose patients to unnecessary risks, while under-dissection could lead to undetected metastases. Despite its importance, predicting the exact metastasis status during surgery remains challenging. To address this challenge and meet the urgent need in clinical practice, this study presents the Deep Knowledge-infused Transformer (DKiT) model, designed to predict LNS metastasis in previously unexamined regions by capturing the relationships between LNSs. Furthermore, DKiT is augmented with clinical prior knowledge through a multi-stage infusion mechanism during the decoding phase, enhancing both model performance and interpretability. Additionally, we developed an AI-powered intraoperative decision support system based on DKiT, which provides real-time surgical recommendations informed by frozen pathology results. Experimental results show that DKiT achieves an AUC score of 0.812 for LNS-level metastasis prediction, outperforming other comparative methods. The clinical system achieves a recall of 0.930 and precision of 0.865 in the retrospective cohort collected from collaborating hospitals, highlighting its potential in guiding NSCLC treatment decisions. The source code is available at https://github.com/czifan/DKiT.",
  "authors": [
    {
      "name": "Zhao, Jie",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Chen, Zifan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yang, Guangzhengao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "He, Yijiang",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhang, Li",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Dong, Bin",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Lung",
    "Modalities -> Other",
    "Applications -> Other",
    "Machine Learning -> Deep Learning",
    "Surgery -> Planning and Simulation",
    "Special Topic -> Low-Cost and Point-of-Care Imaging Solutions"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/3436_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}