{
  "id": "miccai-3267",
  "title": "MedVLM-R1: Incentivizing Medical Reasoning Capability of Vision-Language Models (VLMs) via Reinforcement Learning",
  "abstract": "Reasoning is a critical frontier for advancing medical image analysis, where transparency and trustworthiness play a central role in both clinician trust and regulatory approval. Although Medical Visual Language Models (VLMs) show promise for radiological tasks, most existing VLMs merely produce final answers without revealing the underlying reasoning. To address this gap, we introduce MedVLM-R1, a medical VLM that explicitly generates natural language reasoning to enhance transparency and trustworthiness. Instead of relying on supervised fine-tuning (SFT), which often suffers from overfitting to training distributions and fails to foster genuine reasoning, MedVLM-R1 employs a reinforcement learning framework that incentivizes the model to discover human-interpretable reasoning paths without using any reasoning references. Despite limited training data (600 visual question answering samples) and model parameters (2B), MedVLM-R1 boosts accuracy from 55.11% to 78.22% across MRI, CT, and X-ray benchmarks, outperforming larger models trained on over a million samples. It also demonstrates robust domain generalization under out-of-distribution tasks. By unifying medical image analysis with explicit reasoning, MedVLM-R1 marks a pivotal step toward trustworthy and interpretable AI in clinical practice.",
  "authors": [
    {
      "name": "Pan, Jiazhen",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liu, Che",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wu, Junde",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liu, Fenglin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhu, Jiayuan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Hongwei Bran",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Chen, Chen",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Ouyang, Cheng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Rueckert, Daniel",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Lung",
    "Modalities -> CT / X-Ray",
    "Modalities -> MRI",
    "Applications -> Computer Aided Diagnosis",
    "Machine Learning -> Deep Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/3267_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}