{
  "id": "miccai-4597",
  "title": "CF-Seg: Counterfactuals meet Segmentation",
  "abstract": "Segmenting anatomical structures in medical images plays an important role in the quantitative assessment of various diseases. However, accurate segmentation becomes significantly more challenging in the presence of disease. Disease patterns can alter the appearance of surrounding healthy tissues, introduce ambiguous boundaries, or even obscure critical anatomical structures. As such, segmentation models trained on real-world datasets may struggle to provide good anatomical segmentation, leading to potential misdiagnosis. In this paper, we generate counterfactual (CF) images to simulate how the same anatomy would appear in the absence of disease without altering the underlying structure. We then use these CF images to segment structures of interest, without requiring any changes to the underlying segmentation model. Our experiments on two real-world clinical chest X-ray datasets show that the use of counterfactual images improves anatomical segmentation, thereby aiding downstream clinical decision-making.",
  "authors": [
    {
      "name": "Mehta, Raghav",
      "affiliation": null,
      "email": null
    },
    {
      "name": "De Sousa Ribeiro, Fabio",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Xia, Tian",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Roschewitz, Mélanie",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Santhirasekaram, Ainkaran",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Marshall, Dominic C.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Glocker, Ben",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Lung",
    "Modalities -> CT / X-Ray",
    "Applications -> Image Segmentation"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/4597_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}