{
  "id": "miccai-0658",
  "title": "GL-LCM: Global-Local Latent Consistency Models for Fast High-Resolution Bone Suppression in Chest X-Ray Images",
  "abstract": "Chest X-Ray (CXR) imaging for pulmonary diagnosis raises significant challenges, primarily because bone structures can obscure critical details necessary for accurate diagnosis. Recent advances in deep learning, particularly with diffusion models, offer significant promise for effectively minimizing the visibility of bone structures in CXR images, thereby improving clarity and diagnostic accuracy. Nevertheless, existing diffusion-based methods for bone suppression in CXR imaging struggle to balance the complete suppression of bones with preserving local texture details. Additionally, their high computational demand and extended processing time hinder their practical use in clinical settings. To address these limitations, we introduce a Global-Local Latent Consistency Model (GL-LCM) architecture. This model combines lung segmentation, dual-path sampling, and global-local fusion, enabling fast high-resolution bone suppression in CXR images. To tackle potential boundary artifacts and detail blurring in local-path sampling, we further propose Local-Enhanced Guidance, which addresses these issues without additional training. Comprehensive experiments on a self-collected dataset SZCH-X-Rays, and the public dataset JSRT, reveal that our GL-LCM delivers superior bone suppression and remarkable computational efficiency, significantly outperforming several competitive methods. Our code is available at https://github.com/diaoquesang/GL-LCM.",
  "authors": [
    {
      "name": "Sun, Yifei",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Chen, Zhanghao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zheng, Hao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lu, Yuqing",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Duan, Lixin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Fan, Fenglei",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Elazab, Ahmed",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wan, Xiang",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wang, Changmiao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Ge, Ruiquan",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Lung",
    "Modalities -> CT / X-Ray",
    "Applications -> Image Synthesis / Augmentation / Super-Resolution"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/0658_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}