{
  "id": "miccai-0542",
  "title": "Prototype-Based Multiple Instance Learning for Gigapixel Whole Slide Image Classification",
  "abstract": "Multiple Instance Learning (MIL) methods have succeeded remarkably in histopathology whole slide image (WSI) analysis. However, most MIL models only offer attention-based explanations that do not faithfully capture the model’s decision mechanism and do not allow human-model interaction. To address these limitations, we introduce ProtoMIL, an inherently interpretable MIL model for WSI analysis that offers user-friendly explanations and supports human intervention. Our approach employs a sparse autoencoder to discover human-interpretable concepts from the image feature space, which are then used to train ProtoMIL. The model represents predictions as linear combinations of concepts, making the decision process transparent. Furthermore, ProtoMIL allows users to perform model interventions by altering the input concepts. Experiments on two widely used pathology datasets demonstrate that ProtoMIL achieves a classification performance comparable to state-of-the-art MIL models while offering intuitively understandable explanations. Moreover, we demonstrate that our method can eliminate reliance on diagnostically irrelevant information via human intervention, guiding the model toward being right for the right reason.",
  "authors": [
    {
      "name": "Sun, Susu",
      "affiliation": null,
      "email": null
    },
    {
      "name": "van Midden, Dominique",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Litjens, Geert",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Baumgartner, Christian F.",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Breast",
    "Body -> Urology",
    "Modalities -> Microscopy",
    "Applications -> Computational (Integrative) Pathology",
    "Machine Learning -> Interpretability / Explainability"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/0542_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}