{
  "id": "miccai-5008",
  "title": "PRECISE-AS: Personalized Reinforcement Learning for Efficient Point-of-Care Echocardiography in Aortic Stenosis Diagnosis",
  "abstract": "Aortic stenosis (AS) is a life-threatening condition caused by a narrowing of the aortic valve, leading to impaired blood flow. Despite its high prevalence, access to echocardiography (echo)—the gold-standard diagnostic tool—is often limited due to resource constraints, particularly in rural and underserved areas. Point-of-care ultrasound (POCUS) offers a more accessible alternative but is restricted by operator expertise and the challenge of selecting the most relevant imaging views. To address this, we propose a reinforcement learning (RL)-driven active video acquisition framework that dynamically selects each patient’s most informative echo videos. Unlike traditional methods that rely on a fixed set of videos, our approach continuously evaluates whether additional imaging is needed, optimizing both accuracy and efficiency. Tested on data from 2,572 patients, our method achieves 80.6% classification accuracy while using only 47% of the echo videos compared to a full acquisition. These results demonstrate the potential of active feature acquisition to enhance AS diagnosis, making echocardiographic assessments more efficient, scalable, and personalized.",
  "authors": [
    {
      "name": "Saadat, Armin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Hashemi, Nima",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Vaseli, Hooman",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Tsang, Michael Y.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Luong, Christina",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Van de Panne, Michiel",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Tsang, Teresa S. M.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Abolmaesumi, Purang",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Cardiac",
    "Modalities -> Photograph / Video",
    "Modalities -> Ultrasound",
    "Applications -> Computer Aided Diagnosis",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Interpretability / Explainability",
    "Machine Learning -> Uncertainty",
    "Special Topic -> Low-Cost and Point-of-Care Imaging Solutions",
    "Special Topic -> MIC and CAI Solutions for Limited-Resource Environments"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/5008_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}