{
  "id": "miccai-2692",
  "title": "Edge-semantic Synergy Fusion and Adaptive Noise-aware for Weakly Supervised Pathological Tissue Segmentation",
  "abstract": "Existing studies on weakly supervised pathological tissue segmentation predominantly rely on class activation maps (CAMs) to generate pixel-level pseudo-masks from image-level labels. However, CAMs tend to emphasize only the most discriminative regions, resulting in boundary noise that undermines the quality of pseudo-masks and degrades segmentation performance. To address these challenges, we propose a novel weakly supervised pathological tissue segmentation framework: Edge-semantic Synergy Fusion and Adaptive Noise-aware (ESFAN) mechanism. In the classification phase, the Edge-semantic Synergy Fusion (ESF) improves the quality of pseudo-masks by incorporating four synergistic components. The hybrid edge-aware transformer refines boundaries, while the pyramid context integrator captures multi-scale context. The context channel amplifier fine-tunes semantic features, and the adaptive fusion gating balances feature map contributions using learnable spatial weights. In the segmentation phase, we propose an Adaptive Noise-aware Mechanism (ANM) that incorporates adaptive weighted cross-entropy, uncertainty regularization, and spatial smoothing constraints to mitigate noise in pseudo-masks and enhance segmentation robustness. Extensive experiments on the LUAD-HistoSeg and BCSS datasets demonstrate that ESFAN significantly outperforms state-of-the-art methods. The code is available at: \\url{https://github.com/Sameer-815/ESFAN}.",
  "authors": [
    {
      "name": "Zhang, Hualong",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Feng, Siyang",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Huan, Zihan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wang, Huadeng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liu, Zhenbing",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lan, Rushi",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Pan, Xipeng",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Lung",
    "Applications -> Computational (Integrative) Pathology",
    "Applications -> Image Segmentation",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Semi- / Weakly- / Self-supervised Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2692_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}