{
  "id": "miccai-1017",
  "title": "A Causality-Inspired Model for Intima-Media Thickening Assessment in Ultrasound Videos",
  "abstract": "Carotid atherosclerosis represents a significant health risk, with its early diagnosis primarily dependent on ultrasound-based assessments of carotid intima-media thickening. However, during carotid ultrasound screening, significant view variations cause style shifts, impairing content cues related to thickening, such as lumen anatomy, which introduces spurious correlations that hinder assessment. Therefore, we propose a novel causal-inspired method for assessing carotid intima-media thickening in frame-wise ultrasound videos, which focuses on two aspects: eliminating spurious correlations caused by style and enhancing causal content correlations. Specifically, we introduce a novel Spurious Correlation Elimination (SCE) module to remove non-causal style effects by enforcing prediction invariance with style perturbations. Simultaneously, we propose a Causal Equivalence Consolidation (CEC) module to strengthen causal content correlation through adversarial optimization during content randomization. Furthermore, we design a Causal Transition Augmentation (CTA) module to ensure smooth causal flow by integrating an auxiliary pathway with text prompts and connecting it through contrastive learning. The experimental results on our in-house carotid ultrasound video dataset achieved an accuracy of 86.93%, demonstrating the superior performance of the proposed method. Code is available at https://github.com/xielaobanyy/causal-imt.",
  "authors": [
    {
      "name": "Gao, Shuo",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yang, Meng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Xue, Jun",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Chen, Yang",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhang, Jingyang",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhou, Guangquan",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Vasculature",
    "Modalities -> Ultrasound",
    "Applications -> Computer Aided Diagnosis",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Interpretability / Explainability"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/1017_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}