{
  "id": "miccai-2773",
  "title": "LVPNet: A Latent-variable-based Prediction-driven End-to-end Framework for Lossless Compression of Medical Images",
  "abstract": "Autoregressive Initial Bits is a framework that integrates sub-image autoregression and latent variable modeling, demonstrating its advantages in lossless medical image compression. However, in existing methods, the image segmentation process leads to an even distribution of latent variable information across each sub-image, which in turn causes posterior collapse and inefficient utilization of latent variables. To deal with these issues, we propose a prediction-based end-to-end lossless medical image compression method named LVPNet, leveraging global latent variables to predict pixel values and encoding predicted probabilities for lossless compression. Specifically, we introduce the Global Multi-scale Sensing Module (GMSM), which extracts compact and informative latent representations from the entire image, effectively capturing spatial dependencies within the latent space. Furthermore, to mitigate the information loss introduced during quantization, we propose the Quantization Compensation Module (QCM), which learns the distribution of quantization errors and refines the quantized features to compensate for quantization loss. Extensive experiments on challenging benchmarks demonstrate that our method achieves superior compression efficiency compared to state-of-the-art lossless image compression approaches, while maintaining competitive inference speed. The code is at https://github.com/scy-Jackel/LVPNet.",
  "authors": [
    {
      "name": "Song, Chenyue",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Hui, Chen",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lin, Qing",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhang, Wei",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Siqiao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhu, Haiqi",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhang, Shengping",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Zhixuan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liu, Shaohui",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Jiang, Feng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Xiang",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Machine Learning -> Deep Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2773_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}