{
  "id": "miccai-4278",
  "title": "PathoPrompt: Cross-Granular Semantic Alignment for Medical Pathology Vision-Language Models",
  "abstract": "Pre-trained visual-language (V-L) models have demonstrated impressive generalization capabilities on various downstream tasks, yet their performance is significantly influenced by the input text prompts. Previous studies (e.g., CoPrompt) have attempted to use detailed descriptions generated by LLM to assist model learning. For example, while a coarse-grained prompt like “A photo of Debris.” may be less informative, a fine-grained description such as “Debris consists of dead cells and matrix fragments.” provides additional context, resulting in enhanced model performance. However, existing methods generally lack the sensitivity to capture the subtle semantic differences that are crucial for accurately classifying pathology images. To tackle this challenge, we introduce PathoPrompt, a framework that leverages Cross-Granular Semantic Alignment to improve sensitivity to refine the model’s ability to capture subtle semantic variations in pathology image classification. Specifically, we introduce token-level fine-grained alignment, allowing the model to capture subtle differences that are crucial for accurate pathology image classification. Further, Cross-Granular Semantic Distillation improves the model’s ability to generalize by filtering out irrelevant information from both coarse and fine-grained prompts. Moreover, PathoPrompt employs a prototype-based cross-modal separation mechanism, promoting distinct class boundaries by separating image and text semantics for more effective multi-modal representation learning. Experiments on five pathology datasets and three different task types demonstrate that our method achieves superior performance compared to previous methods.",
  "authors": [
    {
      "name": "Huang, Runlin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liang, Haohui",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Cai, Hongmin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhuo, Weipeng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Fan, Wentao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Su, Weifeng",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> other",
    "Modalities -> Other",
    "Applications -> Computer Aided Diagnosis",
    "Machine Learning -> Deep Learning",
    "Special Topic -> MIC and CAI Solutions for Limited-Resource Environments"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/4278_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}