{
  "id": "miccai-2882",
  "title": "CENet: Context Enhancement Network for Medical Image Segmentation",
  "abstract": "Medical image segmentation, particularly in multi-domain scenarios, demands precise preservation of anatomical structures across diverse representations. While deep learning has advanced this field, existing models often struggle with boundary representation, variability in organ morphology, and information loss during downsampling, limiting their accuracy and robustness. To address these challenges, we propose the Context Enhancement Network (CENet), a novel segmentation framework featuring two key innovations. First, the Dual Selective Enhancement Block (DSEB) integrated into skip connections enhances boundary details and improves the detection of smaller organs in a context-aware manner. Second, the Context Feature Attention Module (CFAM) in the decoder employs a multi-scale design to maintain spatial integrity, reduce feature redundancy, and mitigate overly enhanced representations. Extensive evaluations on both radiology and dermoscopic datasets demonstrate that CENet outperforms state-of-the-art (SOTA) methods in multi-organ segmentation and boundary detail preservation, offering a robust and accurate solution for complex medical image analysis tasks. The source code is publicly available at https://github.com/xmindflow/cenet.",
  "authors": [
    {
      "name": "Bozorgpour, Afshin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Kolahi, Sina Ghorbani",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Azad, Reza",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Hacihaliloglu, Ilker",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Merhof, Dorit",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Abdomen",
    "Body -> Brain",
    "Body -> Lung",
    "Applications -> Image Segmentation",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Foundation Models"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2882_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}