{
  "id": "miccai-2780",
  "title": "MS-IQA: A Multi-Scale Feature Fusion Network for PET/CT Image Quality Assessment",
  "abstract": "Positron Emission Tomography / Computed Tomography (PET/CT) plays a critical role in medical imaging, combining functional and anatomical information to aid in accurate diagnosis. However, image quality degradation due to noise, compression and other factors could potentially lead to diagnostic uncertainty and increase the risk of misdiagnosis. When evaluating the quality of a PET/CT image, both low-level features like distortions and high-level features like organ anatomical structures affect the diagnostic value of the image. However, existing medical image quality assessment (IQA) methods are unable to account for both feature types simultaneously. In this work, we propose MS-IQA, a novel multi-scale feature fusion network for PET/CT IQA, which utilizes multi-scale features from various intermediate layers of ResNet and Swin Transformer, enhancing its ability of perceiving both local and global information. In addition, a multi-scale feature fusion module is also introduced to effectively combine high-level and low-level intermediate features through a dynamically weighted channel attention mechanism. Finally, to fill the blank of PET/CT IQA dataset, we construct PET-CT-IQA-DS, a dataset containing 2,700 varying-quality PET/CT images with quality scores assigned by radiologists. Experiments on our dataset and the publicly available LDCTIQAC2023 dataset demonstrate that our proposed model has achieved superior performance against existing state-of-the-art methods in various IQA metrics. This work provides an accurate and efficient IQA method for PET/CT. Our code and dataset are available at https://github.com/MS-IQA/MS-IQA/.",
  "authors": [
    {
      "name": "Li, Siqiao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Hui, Chen",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhang, Wei",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Liang, Rui",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Song, Chenyue",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Jiang, Feng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhu, Haiqi",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Zhixuan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Huang, Hong",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Xiang",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Machine Learning -> Deep Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2780_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}