{
  "id": "miccai-2047",
  "title": "KidneyDepth: A Synthetic Kidney Dataset for Metric Depth Estimation in Ureteroscopy",
  "abstract": "Monocular Metric Depth Estimation (MDE) in endoscopic images is a crucial step to improve navigation \nduring medical procedures, as it enables the estimation of dense, real-scale 3D maps of the organs. \nFor instance, in monocular flexible ureteroscopy (fURS), accurate navigation and real-scale information are \nessential for locating and removing kidney stones efficiently. \nCurrently, the most promising approach to infer depth from single passive cameras is by supervised training of large neural networks,\nso-called foundation models for MDE. However, the depth output of these models is biased when the training data \ndomain does not fit the goal domain (both camera and scene). At the same time, \none of the greatest challenges in medical imaging is the lack of annotated datasets, as obtaining real \nground-truth (e.g., depth data) is difficult. To overcome this, simulation has become a valuable tool in ureteroscopic imaging \nresearch. In this study, we introduce KidneyDepth, a synthetic dataset designed to reduce the gap between simulated and \nreal-world 3D imaging. It includes a variety of shapes (e.g. mesh from CT scan, geometric primitive forms) along with \ndifferent textures and lighting conditions, generated by BlenderProc2~\\cite{Denninger2023}.\nTo assess the effectiveness of KidneyDepth, we fine-tune two state-of-the-art MDE models (Depth Anything V2 and ZoeDepth) and \ntest their performance on both simulated and real ureteroscopic images. Additionally, we evaluate the validity of their \noutput by using the inferred depths in the context of a RGB-D SLAM system. Our results show that training models on a \nsynthetic dataset with diverse structures and lighting conditions improves depth estimation in real endoscopic images \nand our simulations show that these RGB-D images enhance overall SLAM accuracy. \nThe KidneyDepth dataset can be found in https://zenodo.org/records/14893421.",
  "authors": [
    {
      "name": "Oliva-Maza, Laura",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Steidle, Florian",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Klodmann, Julian",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Strobl, Klaus",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Miernik, Arkadiusz",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Triebel, Rudolph",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Urology",
    "Modalities -> Endoscopy",
    "Applications -> Image-Guided Interventions",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Foundation Models",
    "Surgery -> Navigation"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2047_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}