{
  "id": "miccai-1603",
  "title": "A Curvature-Guided Diffeomorphic Mesh Deformation Framework for Lifespan Brain Cortical Surface Reconstruction",
  "abstract": "Accurate and automatic lifespan brain cortical surface reconstruction (CSR) is crucial for analyzing brain development and aging. Traditional pipelines involve multiple processing steps, which are time-intensive and inefficient for handling larger datasets. While deep learning-based methods can accelerate reconstruction speed and produce high-quality meshes compared to traditional approaches, they are often constrained to a single time point. The limitation arises from the significant variations in cortical surfaces across age groups, particularly in folding patterns. In this paper, we propose a novel curvature-guided diffeomorphic mesh deformation framework for lifespan brain CSR. Specifically, to preserve correct topology structure and uniformity, the framework employs multiple deformation blocks to gradually warp a simple smooth template mesh to a complex target surface with high folding. Considering that curvature is closely associated with folding patterns, we introduce curvature map prediction as an auxiliary task to guide the deformation process, enhancing the anatomical accuracy to facilitate subsequent cortical morphometry. Notably, incorporating curvature can also expedite model convergence. Our method is evaluated on a large-scale brain dataset with 2,132 subjects spanning ages 0 to 100 years. Experimental results show that our reconstructed surfaces have fewer geometric errors and optimal mesh regularity while being several orders of magnitude faster than traditional pipelines. Our code is available at https://github.com/TL9792/CCF.",
  "authors": [
    {
      "name": "Teng, Lin",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhao, Shen",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Shi, Feng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Shen, Dinggang",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Brain",
    "Modalities -> MRI",
    "Applications -> Computational (Integrative) Pathology",
    "Applications -> Computational Anatomy and Physiology",
    "Applications -> Computer Aided Diagnosis",
    "Machine Learning -> Deep Learning",
    "Surgery -> Other",
    "Special Topic -> Low-Cost and Point-of-Care Imaging Solutions"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/1603_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}