{
  "id": "miccai-1547",
  "title": "Prompt-DAS: Annotation-Efficient Prompt Learning for Domain Adaptive Semantic Segmentation of Electron Microscopy Images",
  "abstract": "Domain adaptive segmentation (DAS) of numerous organelle instances from large-scale electron microscopy (EM)  is a promising way to enable annotation-efficient learning.  Inspired by SAM, we propose a promptable multitask framework, namely Prompt-DAS,  which is flexible enough to utilize any number of point prompts during the adaptation training stage and testing stage. Thus, with varying prompt configurations,  Prompt-DAS can perform unsupervised domain adaptation (UDA) and weakly supervised domain adaptation (WDA), as well as interactive segmentation during testing. Unlike the foundation model SAM, which necessitates a prompt for each individual object instance, Prompt-DAS is only trained on a small dataset and can utilize full points on all instances,  sparse points on partial instances, or even no points at all, facilitated by the incorporation of an auxiliary center-point detection task. Moreover,  a novel prompt-guided contrastive learning is proposed to enhance discriminative feature learning. Comprehensive experiments conducted on challenging benchmarks demonstrate the effectiveness of the proposed approach over existing UDA, WDA, and SAM-based approaches.",
  "authors": [
    {
      "name": "Chen, Jiabao",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Xiong, Shan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Peng, Jialin",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Modalities -> Microscopy",
    "Applications -> Image Segmentation",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Domain Adaptation / Harmonization",
    "Machine Learning -> Semi- / Weakly- / Self-supervised Learning"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/1547_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}