{
  "id": "miccai-3992",
  "title": "Influence of Classification Task and Distribution Shift Type on OOD Detection in Fetal Ultrasound",
  "abstract": "Reliable out-of-distribution (OOD) detection is important for safe deployment of deep learning models in fetal ultrasound amidst heterogeneous image characteristics and clinical settings. OOD detection relies on estimating a classification model’s uncertainty, which should increase for OOD samples. While existing research has largely focused on uncertainty quantification methods, this work investigates the impact of the classification task itself. Through experiments with eight uncertainty quantification methods across four classification tasks on the same image dataset, we demonstrate that OOD detection performance significantly varies with the task, and that the best task depends on the defined ID-OOD criteria; specifically, whether the  OOD sample is due to: i) an image characteristic shift or ii) an anatomical feature shift. Furthermore, we reveal that superior OOD detection does not guarantee optimal abstained prediction, underscoring the necessity to align task selection and uncertainty strategies with the specific downstream application in medical image analysis. Code: https://github.com/wong-ck/ood-fetal-us.",
  "authors": [
    {
      "name": "Wong, Chun Kit",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Christensen, Anders N.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Bercea, Cosmin I.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Schnabel, Julia A.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Tolsgaard, Martin G.",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Feragen, Aasa",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Fetal / Pediatric Imaging",
    "Modalities -> Ultrasound",
    "Applications -> Anomaly Detection",
    "Machine Learning -> Uncertainty"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/3992_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}