{
  "id": "miccai-4812",
  "title": "ITMatch: Arch-Guided Semi-Supervised Tooth Arrangement via Iterative Confidence Evaluation",
  "abstract": "Automated tooth arrangement is a crucial stage in digital orthodontic planning. Existing learning-based methods are based on large-scale expert-designed treatment plans, but high-quality arrangement results are difficult to obtain. Semi-supervised learning is commonly applied in scenarios with limited labeled data. However, due to the challenge of evaluating the confidence of pseudo-labels, previous works have not effectively explored semi-supervised tooth arrangement as a regression problem. To address this, we propose a semi-supervised tooth arrangement framework guided by dental arch priors and iterative confidence evaluation. We establish a teacher-student-based semi-supervised framework and introduce a weak-to-strong consistency regularization tailored for 3D point clouds. Inspired by optimization problems, we iteratively analyze errors to assess the confidence of pseudo-labels generated by the teacher network, mitigating the challenge of filtering low-quality pseudo-labels in regression. In addition, we predict the dental arch width to reduce the complexity of learning intricate transformations and leverage it as orthodontic prior information to improve arrangement accuracy. Our framework fills a critical gap in the field, and its core ideas can be generalized to other regression tasks. On a high-quality dataset, our method achieves competitive results with minimal labeled data. Code and typical data will be released soon.",
  "authors": [
    {
      "name": "Wang, Chengyuan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "He, Zhihui",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Chen, Li",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yang, Shidong",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Sun, Guiyu",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Duan, Fan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Wang, Shuo",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Zhou, Yanheng",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> other",
    "Modalities -> Other",
    "Applications -> Computer Aided Diagnosis",
    "Applications -> Other",
    "Machine Learning -> Semi- / Weakly- / Self-supervised Learning",
    "Surgery -> Planning and Simulation"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/4812_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}