{
  "id": "miccai-1216",
  "title": "InstructX2X: An Interpretable Local Editing Model for Counterfactual Medical Image Generation",
  "abstract": "Counterfactual medical image generation have emerged as a critical tool for enhancing AI-driven systems in medical domain by answering “what-if” questions. However, existing approaches face two fundamental limitations: First, they fail to prevent unintended modifications, resulting collateral changes in demographic attributes when only disease features should be affected. Second, they lack interpretability in their editing process, which significantly limits their utility in real-world medical applications. To address these limitations, we present InstructX2X, a novel interpretable local editing model for counterfactual medical image generation featuring Region-Specific Editing. This approach restricts modifications to specific regions, effectively preventing unintended changes while simultaneously providing a Guidance Map that offers inherently interpretable visual explanations of the editing process. Additionally, we introduce MIMIC-EDIT-INSTRUCTION, a dataset for counterfactual medical image generation derived from expert-verified medical VQA pairs. Through extensive experiments, InstructX2X achieve state-of-the-art performance across all major evaluation metrics. Our model successfully generates high-quality counterfactual chest X-ray images along with interpretable explanations, as validated by experienced radiologists. Our code and dataset are publicly available at https://github.com/hgminn/InstructX2X.",
  "authors": [
    {
      "name": "Min, Hyungi",
      "affiliation": null,
      "email": null
    },
    {
      "name": "You, Taeseung",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Lee, Hangyeul",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Cho, Yeongjae",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Cho, Sungzoon",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> Breast",
    "Body -> Cardiac",
    "Body -> Lung",
    "Modalities -> CT / X-Ray",
    "Applications -> Image Synthesis / Augmentation / Super-Resolution",
    "Applications -> Visualization in Biomedical Imaging",
    "Machine Learning -> Deep Learning",
    "Machine Learning -> Foundation Models",
    "Machine Learning -> Interpretability / Explainability"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/1216_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}