{
  "id": "miccai-2021",
  "title": "Intelligent Virtual Sonographer (IVS): Enhancing Physician-Robot-Patient Communication",
  "abstract": "The advancement and maturity of large language models (LLMs) and robotics have unlocked vast potential for human-computer interaction, particularly in the field of robotic ultrasound. While existing research primarily focuses on either patient-robot or physician-robot interaction, the role of an intelligent virtual sonographer (IVS) bridging physician-robot-patient communication remains underexplored. This work introduces a conversational virtual agent in Extended Reality (XR) that facilitates real-time interaction between physicians, a robotic ultrasound system(RUS), and patients. The IVS agent communicates with physicians in a professional manner while offering empathetic explanations and reassurance to patients. Furthermore, it actively controls the RUS by executing physician commands and transparently relays these actions to the patient. By integrating LLM-powered dialogue with speech-to-text, text-to-speech, and robotic control, our system enhances the efficiency, clarity, and accessibility of robotic ultrasound acquisition. This work constitutes a first step toward understanding how IVS can bridge communication gaps in physician-robot-patient interaction, providing more control and therefore trust into physician-robot interaction while improving patient experience and acceptance of robotic ultrasound.",
  "authors": [
    {
      "name": "Song, Tianyu",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Li, Feng",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Bi, Yuan",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Karlas, Angelos",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Yousefi, Amir",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Branzan, Daniela",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Jiang, Zhongliang",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Eck, Ulrich",
      "affiliation": null,
      "email": null
    },
    {
      "name": "Navab, Nassir",
      "affiliation": null,
      "email": null
    }
  ],
  "subject_areas": [
    "Body -> other",
    "Modalities -> Robotics",
    "Modalities -> Ultrasound",
    "Applications -> Other",
    "Surgery -> Mixed / Augmented / Virtual Reality"
  ],
  "external_links": [
    {
      "type": "pdf",
      "url": "https://papers.miccai.org/miccai-2025/paper/2021_paper.pdf",
      "description": "Full paper PDF"
    }
  ],
  "publication_date": "2025-10-01",
  "raw_data_source": "{}"
}